Repository: wp-plugins/global-body-mass-index-calculator
Catalog: languages/GBMI-calc-*.po
Languages: ro_ro

source: Grown ups
ro_ro: Adulti

source: Child
ro_ro: Copii

source: Please enter a valid height and weight.
ro_ro: Vă rugăm să introduceți o înălțime și greutate validă.

source: Height
ro_ro: Înălțime

source: ft
ro_ro: picioare

source: Weight
ro_ro: Greutate

source: pounds
ro_ro: livre

source: GBMI Calculator
ro_ro: Calculator IMC

source: Gender
ro_ro: Sex

source: Male
ro_ro: M

source: Female
ro_ro: F

source: inches
ro_ro: inch

source: severly underweight
ro_ro: Greutate sub limita normala

source: underweight
ro_ro: Greutate sub limita normala

source: normal
ro_ro: Greutate normala

source: overweight
ro_ro: Suprapondere

source: moderately obese
ro_ro: Obezitate

source: severly obese
ro_ro: Obezitate

source: Your BMI is
ro_ro: IMC

source: This puts you in the
ro_ro: Acest lucru vă pune în

source: Age
ro_ro: Vârstă

source: Child BMI calculator is only valid for children between 2 and 20 years.
ro_ro: Indicele de masa corporala pentru copii între 2 și 20 de ani.

source: Get child BMI!
ro_ro: Calculează

source: Get BMI!
ro_ro: Calculează

source: Your child's BMI is:
ro_ro: IMC

source: BMI percentile
ro_ro: percentila

source: weight range
ro_ro: interval de greutate

source: Enter a valid height and weight
ro_ro: Vă rugăm să introduceți o înălțime și greutate validă.

source: Enter a valid height
ro_ro: Vă rugăm să introduceți o înălțime validă.

source: Enter a valid weight
ro_ro: Vă rugăm să introduceți o greutate validă.

source: Enter a valid age
ro_ro: Vă rugăm să introduceți o vârstă validă.
